RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_usart.c
        USART_CTL2(usart_periph) &= ~(USART_CTL2_OSB);
        USART_CTL2(usart_periph) |= osb;
    }
}

/*!
    \brief      enable receiver timeout
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_receiver_timeout_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0010U), ERR_PERIPH);
    } else
#endif
    {
        USART_CTL1(usart_periph) |= USART_CTL1_RTEN;
    }
}

/*!
    \brief      disable receiver timeout
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_receiver_timeout_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0011U), ERR_PERIPH);
    } else
#endif
    {
        USART_CTL1(usart_periph) &= ~(USART_CTL1_RTEN);
    }
}

/*!
    \brief      configure receiver timeout threshold
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  rtimeout: 0x00000000-0x00FFFFFF, receiver timeout value in terms of number of baud clocks
    \param[out] none
    \retval     none
*/
void usart_receiver_timeout_threshold_config(uint32_t usart_periph, uint32_t rtimeout)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0012U), ERR_PERIPH);
    } else if(NOT_USART_RECEIVE_TIMEOUT(rtimeout)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0012U), ERR_PARAM_INVALID);
    } else
#endif
    {
        USART_RT(usart_periph) &= ~(USART_RT_RT);
        USART_RT(usart_periph) |= rtimeout;
    }
}

/*!
    \brief      USART transmit data function
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  data: data of transmission
    \param[out] none
    \retval     none
*/
void usart_data_transmit(uint32_t usart_periph, uint16_t data)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0013U), ERR_PERIPH);
    } else if(NOT_USART_TRANSMIT_DATA(data)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0013U), ERR_PARAM_INVALID);
    } else
#endif
    {
        USART_TDATA(usart_periph) = USART_TDATA_TDATA & (uint32_t)data;
    }
}

/*!
    \brief      USART receive data function
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     data of received
*/
uint16_t usart_data_receive(uint32_t usart_periph)
{
    uint16_t reval = 0U;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0014U), ERR_PERIPH);
    } else
#endif
    {
        reval = (uint16_t)(GET_BITS(USART_RDATA(usart_periph), 0U, 8U));
    }
    return reval;
}

/*!
    \brief      enable USART command
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  cmdtype: command type
                only one parameter can be selected which is shown as below:
      \arg        USART_CMD_SBKCMD: send break command
      \arg        USART_CMD_MMCMD: mute mode command
      \arg        USART_CMD_RXFCMD: receive data flush command
      \arg        USART_CMD_TXFCMD: transmit data flush request
    \param[out] none
    \retval     none
*/
void usart_command_enable(uint32_t usart_periph, uint32_t cmdtype)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0015U), ERR_PERIPH);
    } else if(NOT_USART_CMD(cmdtype)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0015U), ERR_PARAM_INVALID);
    } else
#endif
    {
        USART_CMD(usart_periph) |= (cmdtype);
    }
}

/*!
    \brief      enable address 0 match mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_address_0_match_mode_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0016U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL1(usart_periph) |= USART_CTL1_AMEN0;
    }
}

/*!
    \brief      disable address 0 match mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_address_0_match_mode_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0017U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL1(usart_periph) &= ~(USART_CTL1_AMEN0);
    }
}

/*!
    \brief      enable address 1 match mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_address_1_match_mode_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0018U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) |= USART_CTL2_AMEN1;
    }
}

/*!
    \brief      disable address 1 match mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_address_1_match_mode_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0019U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_AMEN1);
    }
}

/*!
    \brief      configure address 0 of the USART
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  addr: 0x00-0xFF, address of USART terminal
    \param[out] none
    \retval     none
*/
void usart_address_0_config(uint32_t usart_periph, uint8_t addr)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x001AU), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

