RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_usart.c
        USART_CTL1(usart_periph) &= ~(USART_CTL1_ADDR0);
        USART_CTL1(usart_periph) |= (USART_CTL1_ADDR0 & (((uint32_t)addr) << CTL1_ADDR0_OFFSET));
    }
}

/*!
    \brief      configure address 1 of the USART
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  addr: 0x00-0xFF, address of USART terminal
    \param[out] none
    \retval     none
*/
void usart_address_1_config(uint32_t usart_periph, uint8_t addr)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x001BU), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_ADDR1);
        USART_CTL2(usart_periph) |= (USART_CTL2_ADDR1 & (((uint32_t)addr) << CTL2_ADDR1_OFFSET));
    }
}

/*!
    \brief      configure address 0 detection mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  addmod: address detection mode
                only one parameter can be selected which is shown as below:
      \arg        USART_ADDM0_4BIT: 4 bits
      \arg        USART_ADDM0_FULLBIT: full bits
    \param[out] none
    \retval     none
*/
void usart_address_0_detection_mode_config(uint32_t usart_periph, uint32_t addmod)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x001CU), ERR_PERIPH);
    } else if(NOT_USART_ADDR_MODE(addmod)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x001CU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL1(usart_periph) &= ~(USART_CTL1_ADDM0);
        USART_CTL1(usart_periph) |= USART_CTL1_ADDM0 & (addmod);
    }
}

/*!
    \brief      configure address 1 detection mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  addmod: address detection mode
                only one parameter can be selected which is shown as below:
      \arg        USART_ADDM1_4BIT: 4 bits
      \arg        USART_ADDM1_FULLBIT: full bits
    \param[out] none
    \retval     none
*/
void usart_address_1_detection_mode_config(uint32_t usart_periph, uint32_t addmod)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x001DU), ERR_PERIPH);
    } else if(NOT_USART_ADDR_MODE(addmod)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x001DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_ADDM1);
        USART_CTL2(usart_periph) |= USART_CTL2_ADDM1 & (addmod);
    }
}

/*!
    \brief      enable mute mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_mute_mode_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x001EU), ERR_PERIPH);
    } else
#endif
    {
        USART_CTL0(usart_periph) |= USART_CTL0_MEN;
    }
}

/*!
    \brief      disable mute mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_mute_mode_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x001FU), ERR_PERIPH);
    } else
#endif
    {
        USART_CTL0(usart_periph) &= ~(USART_CTL0_MEN);
    }
}

/*!
    \brief      configure wakeup method in mute mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  wmethod: two methods be used to enter or exit the mute mode
                only one parameter can be selected which is shown as below:
      \arg        USART_WM_IDLE: idle line
      \arg        USART_WM_ADDR: address mark
    \param[out] none
    \retval     none
*/
void usart_mute_mode_wakeup_config(uint32_t usart_periph, uint32_t wmethod)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0020U), ERR_PERIPH);
    } else if(NOT_USART_WM_METHOD(wmethod)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0020U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL0(usart_periph) &= ~(USART_CTL0_WM);
        USART_CTL0(usart_periph) |= wmethod;
    }
}

/*!
    \brief      enable LIN mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_lin_mode_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0021U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL1(usart_periph) |= USART_CTL1_LMEN;
    }
}

/*!
    \brief      disable LIN mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_lin_mode_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0022U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL1(usart_periph) &= ~(USART_CTL1_LMEN);
    }
}

/*!
    \brief      LIN break detection length
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  lblen: LIN break detection length
                only one parameter can be selected which is shown as below:
      \arg        USART_LBLEN_10B: 10 bits break detection
      \arg        USART_LBLEN_11B: 11 bits break detection
    \param[out] none
    \retval     none
*/
void usart_lin_break_detection_length_config(uint32_t usart_periph, uint32_t lblen)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0023U), ERR_PERIPH);
    } else if(NOT_USART_LBLEN_LENGTH(lblen)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0023U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

