RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_usart.c
        USART_CTL1(usart_periph) &= ~(USART_CTL1_LBLEN);
        USART_CTL1(usart_periph) |= USART_CTL1_LBLEN & (lblen);
    }
}

/*!
    \brief      enable half-duplex mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_halfduplex_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0024U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) |= USART_CTL2_HDEN;
    }
}

/*!
    \brief      disable half-duplex mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_halfduplex_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0025U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_HDEN);
    }
}

/*!
    \brief      enable clock
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_clock_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0026U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL1(usart_periph) |= USART_CTL1_CKEN;
    }
}

/*!
    \brief      disable clock
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_clock_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0027U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL1(usart_periph) &= ~(USART_CTL1_CKEN);
    }
}

/*!
    \brief      configure USART synchronous mode parameters
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  clen: last bit clock pulse
                only one parameter can be selected which is shown as below:
      \arg        USART_CLEN_NONE: clock pulse of the last data bit (MSB) is not output to the CK pin
      \arg        USART_CLEN_EN: clock pulse of the last data bit (MSB) is output to the CK pin
    \param[in]  cph: clock phase
                only one parameter can be selected which is shown as below:
      \arg        USART_CPH_1CK: first clock transition is the first data capture edge
      \arg        USART_CPH_2CK: second clock transition is the first data capture edge
    \param[in]  cpl: clock polarity
                only one parameter can be selected which is shown as below:
      \arg        USART_CPL_LOW: steady low value on CK pin
      \arg        USART_CPL_HIGH: steady high value on CK pin
    \param[out] none
    \retval     none
*/
void usart_synchronous_clock_config(uint32_t usart_periph, uint32_t clen, uint32_t cph, uint32_t cpl)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0028U), ERR_PERIPH);
    } else if(NOT_USART_CLEN_MODE(clen)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else if(NOT_USART_CPH_MODE(cph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else if(NOT_USART_CPL_MODE(cpl)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0028U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
        /* reset USART_CTL1 CLEN,CPH,CPL bits */
        USART_CTL1(usart_periph) &= ~(USART_CTL1_CLEN | USART_CTL1_CPH | USART_CTL1_CPL);

        USART_CTL1(usart_periph) |= (USART_CTL1_CLEN & clen);
        USART_CTL1(usart_periph) |= (USART_CTL1_CPH & cph);
        USART_CTL1(usart_periph) |= (USART_CTL1_CPL & cpl);
    }
}

/*!
    \brief      configure guard time value in smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  guat: 0x00-0xFF
    \param[out] none
    \retval     none
*/
void usart_guard_time_config(uint32_t usart_periph, uint32_t guat)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0029U), ERR_PERIPH);
    } else if(NOT_USART_GUARD_TIME_RANGE(guat)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0029U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_GP(usart_periph) &= ~(USART_GP_GUAT);
        USART_GP(usart_periph) |= (USART_GP_GUAT & ((guat) << GP_GUAT_OFFSET));
    }
}

/*!
    \brief      enable smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x002AU), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) |= USART_CTL2_SCEN;
    }
}

/*!
    \brief      disable smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x002BU), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_SCEN);
    }
}

/*!
    \brief      enable NACK in smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_nack_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x002CU), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) |= USART_CTL2_NKEN;
    }
}

/*!
    \brief      disable NACK in smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_nack_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x002DU), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_NKEN);
    }
}

/*!
    \brief      enable early NACK in smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_early_nack_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x002EU), ERR_PERIPH);
    } else
#endif
    {
        USART_FCS(usart_periph) |= USART_FCS_ELNACK;
    }
}

/*!
    \brief      disable early NACK in smartcard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_smartcard_mode_early_nack_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x002FU), ERR_PERIPH);
    } else
#endif
    {
        USART_FCS(usart_periph) &= ~USART_FCS_ELNACK;
    }
}

/*!
    \brief      configure smartcard auto-retry number
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  scrtnum: 0x00000000-0x00000007, smartcard auto-retry number
    \param[out] none
    \retval     none
*/
void usart_smartcard_autoretry_config(uint32_t usart_periph, uint32_t scrtnum)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0030U), ERR_PERIPH);
    } else if(NOT_USART_SMARTCARD_AUTORETRY_RANGE(scrtnum)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0030U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_SCRTNUM);
        USART_CTL2(usart_periph) |= (USART_CTL2_SCRTNUM & (scrtnum << CTL2_SCRTNUM_OFFSET));
    }
}

/*!
    \brief      configure block length
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  bl: 0x00000000-0x000000FF
    \param[out] none
    \retval     none
*/
void usart_block_length_config(uint32_t usart_periph, uint32_t bl)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0031U), ERR_PERIPH);
    } else if(NOT_USART_BLOCK_LEN_RANGE(bl)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0031U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        USART_RT(usart_periph) &= ~(USART_RT_BL);
        USART_RT(usart_periph) |= (USART_RT_BL & ((bl) << RT_BL_OFFSET));
    }
}

/*!
    \brief      enable IrDA mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_irda_mode_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0032U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

