RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_usart.c
        USART_CTL2(usart_periph) |= USART_CTL2_IREN;
    }
}

/*!
    \brief      disable IrDA mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_irda_mode_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0033U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_IREN);
    }
}

/*!
    \brief      configure the peripheral clock prescaler in USART IrDA low-power or SmartCard mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  psc: 0x00000000-0x000000FF
    \param[out] none
    \retval     none
*/
void usart_prescaler_config(uint32_t usart_periph, uint32_t psc)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0034U), ERR_PERIPH);
    } else if(NOT_USART_IRDA_SMART_PRE_RANGE(psc)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0034U), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_GP(usart_periph) &= ~(USART_GP_PSC);
        USART_GP(usart_periph) |= psc;
    }
}

/*!
    \brief      configure IrDA low-power
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  irlp: IrDA low-power or normal
                only one parameter can be selected which is shown as below:
      \arg        USART_IRLP_LOW:    low-power
      \arg        USART_IRLP_NORMAL: normal
    \param[out] none
    \retval     none
*/
void usart_irda_lowpower_config(uint32_t usart_periph, uint32_t irlp)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0035U), ERR_PERIPH);
    } else if(NOT_USART_IRDA_MODE(irlp)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0035U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_IRLP);
        USART_CTL2(usart_periph) |= (USART_CTL2_IRLP & irlp);
    }
}

/*!
    \brief      configure hardware flow control RTS
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  rtsconfig: enable or disable RTS
                only one parameter can be selected which is shown as below:
      \arg        USART_RTS_ENABLE:  enable RTS
      \arg        USART_RTS_DISABLE: disable RTS
    \param[out] none
    \retval     none
*/
void usart_hardware_flow_rts_config(uint32_t usart_periph, uint32_t rtsconfig)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0036U), ERR_PERIPH);
    } else if(NOT_USART_RTS_CONFIG(rtsconfig)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0036U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_RTSEN);
        USART_CTL2(usart_periph) |= rtsconfig;
    }
}

/*!
    \brief      configure hardware flow control CTS
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  ctsconfig:  enable or disable CTS
                only one parameter can be selected which is shown as below:
      \arg        USART_CTS_ENABLE:  enable CTS
      \arg        USART_CTS_DISABLE: disable CTS
    \param[out] none
    \retval     none
*/
void usart_hardware_flow_cts_config(uint32_t usart_periph, uint32_t ctsconfig)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0037U), ERR_PERIPH);
    } else if(NOT_USART_CTS_CONFIG(ctsconfig)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0037U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~USART_CTL2_CTSEN;
        USART_CTL2(usart_periph) |= ctsconfig;
    }
}

/*!
   \brief      configure hardware flow control coherence mode
   \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
   \param[in]  hcm:
               only one parameter can be selected which is shown as below:
     \arg        USART_HCM_NONE: nRTS signal equals to the rxne status register
     \arg        USART_HCM_EN:   nRTS signal is set when the last data bit has been sampled
   \param[out] none
   \retval     none
*/
void usart_hardware_flow_coherence_config(uint32_t usart_periph, uint32_t hcm)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0038U), ERR_PERIPH);
    } else if(NOT_USART_HCM_CONFIG(hcm)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0038U), ERR_PARAM_INVALID);
    } else
#endif
    {
        USART_CHC(usart_periph) &= ~(USART_CHC_HCM);
        USART_CHC(usart_periph) |= (USART_CHC_HCM & hcm);
    }
}

/*!
    \brief      enable RS485 driver
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_rs485_driver_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0039U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) |= USART_CTL2_DEM;
    }
}

/*!
    \brief      disable RS485 driver
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_rs485_driver_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003AU), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_DEM);
    }
}

/*!
    \brief      configure driver enable assertion time
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  deatime: 0x00000000-0x0000001F
    \param[out] none
    \retval     none
*/
void usart_driver_assertime_config(uint32_t usart_periph, uint32_t deatime)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003BU), ERR_PERIPH);
    } else if(NOT_USART_ASSERTIME_RANGE(deatime)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003BU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL0(usart_periph) &= ~(USART_CTL0_DEA);
        USART_CTL0(usart_periph) |= (USART_CTL0_DEA & ((deatime) << CTL0_DEA_OFFSET));
    }
}

/*!
    \brief      configure driver enable de-assertion time
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  dedtime: 0x00000000-0x0000001F
    \param[out] none
    \retval     none
*/
void usart_driver_deassertime_config(uint32_t usart_periph, uint32_t dedtime)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003CU), ERR_PERIPH);
    } else if(NOT_USART_DE_ASSERTIME_RANGE(dedtime)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003CU), ERR_PARAM_OUT_OF_RANGE);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL0(usart_periph) &= ~(USART_CTL0_DED);
        USART_CTL0(usart_periph) |= (USART_CTL0_DED & ((dedtime) << CTL0_DED_OFFSET));
    }
}

/*!
    \brief      configure driver enable polarity mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  dep: DE signal
                only one parameter can be selected which is shown as below:
      \arg        USART_DEP_HIGH: DE signal is active high
      \arg        USART_DEP_LOW: DE signal is active low
    \param[out] none
    \retval     none
*/
void usart_depolarity_config(uint32_t usart_periph, uint32_t dep)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003DU), ERR_PERIPH);
    } else if(NOT_USART_DEP_CONFIG(dep)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003DU), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
        /* reset DEP bit */
        USART_CTL2(usart_periph) &= ~(USART_CTL2_DEP);
        USART_CTL2(usart_periph) |= (USART_CTL2_DEP & dep);
    }
}

/*!
    \brief      configure USART DMA reception
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  dmacmd: enable or disable DMA for reception
                only one parameter can be selected which is shown as below:
      \arg        USART_RECEIVE_DMA_ENABLE: USART enable DMA for reception
      \arg        USART_RECEIVE_DMA_DISABLE: USART disable DMA for reception
    \param[out] none
    \retval     none
*/
void usart_dma_receive_config(uint32_t usart_periph, uint32_t dmacmd)
{
    uint32_t ctl;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003EU), ERR_PERIPH);
    } else if(NOT_USART_RECEIVE_DMA_CONFIG(dmacmd)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003EU), ERR_PARAM_INVALID);
    } else
#endif
    {
        ctl = USART_CTL2(usart_periph);
        ctl &= ~USART_CTL2_DENR;
        ctl |= dmacmd;
        /* configure DMA reception */
        USART_CTL2(usart_periph) = ctl;
    }
}

/*!
    \brief      configure USART DMA transmission
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  dmacmd: enable or disable DMA for transmission
                only one parameter can be selected which is shown as below:
      \arg        USART_TRANSMIT_DMA_ENABLE: USART enable DMA for transmission
      \arg        USART_TRANSMIT_DMA_DISABLE: USART disable DMA for transmission
    \param[out] none
    \retval     none
*/
void usart_dma_transmit_config(uint32_t usart_periph, uint32_t dmacmd)
{
    uint32_t ctl;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003FU), ERR_PERIPH);
    } else if(NOT_USART_TRANSMIT_DMA_CONFIG(dmacmd)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x003FU), ERR_PARAM_INVALID);
    } else
#endif
    {
        ctl = USART_CTL2(usart_periph);
        ctl &= ~USART_CTL2_DENT;
        ctl |= dmacmd;
        /* configure DMA transmission */
        USART_CTL2(usart_periph) = ctl;
    }
}

/*!
    \brief      disable DMA on reception error
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_reception_error_dma_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0040U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

