RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Source/gd32h75e_usart.c
        USART_CTL2(usart_periph) |= USART_CTL2_DDRE;
    }
}

/*!
    \brief      enable DMA on reception error
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_reception_error_dma_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0041U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);

        USART_CTL2(usart_periph) &= ~(USART_CTL2_DDRE);
    }
}

/*!
    \brief      enable USART to wakeup the mcu from deep-sleep mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_wakeup_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0042U), ERR_PERIPH);
    } else
#endif
    {
        USART_CTL0(usart_periph) |= USART_CTL0_UESM;
    }
}

/*!
    \brief      disable USART to wakeup the mcu from deep-sleep mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[out] none
    \retval     none
*/
void usart_wakeup_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0043U), ERR_PERIPH);
    } else
#endif
    {
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UESM);
    }
}

/*!
    \brief      configure the USART wakeup mode from deep-sleep mode
    \param[in]  usart_periph: USARTx(x=0,1,2,5)
    \param[in]  wum: wakeup mode
                only one parameter can be selected which is shown as below:
      \arg        USART_WUM_ADDR: WUF active on address match
      \arg        USART_WUM_STARTB: WUF active on start bit
      \arg        USART_WUM_RBNE: WUF active on RBNE
    \param[out] none
    \retval     none
*/
void usart_wakeup_mode_config(uint32_t usart_periph, uint32_t wum)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART0125_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0044U), ERR_PERIPH);
    } else if(NOT_USART_WAKEUP_MODE_CONFIG(wum)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0044U), ERR_PARAM_INVALID);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
        /* reset WUM bit */
        USART_CTL2(usart_periph) &= ~(USART_CTL2_WUM);
        USART_CTL2(usart_periph) |= USART_CTL2_WUM & (wum);
    }
}

/*!
    \brief      enable FIFO
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_fifo_enable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0045U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
        /* set FEN bit */
        USART_FCS(usart_periph) |= USART_FCS_FEN;
    }
}

/*!
    \brief      disable FIFO
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     none
*/
void usart_fifo_disable(uint32_t usart_periph)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0046U), ERR_PERIPH);
    } else
#endif
    {
        /* disable USART */
        USART_CTL0(usart_periph) &= ~(USART_CTL0_UEN);
        /* reset FEN bit */
        USART_FCS(usart_periph) &= ~(USART_FCS_FEN);
    }
}

/*!
    \brief      configure transmit FIFO threshold
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  txthreshold: transmit FIFO threshold
                only one parameter can be selected which is shown as below:
      \arg        USART_TFTCFG_THRESHOLD_1_8: transmit FIFO reaches 1/8 of its depth
      \arg        USART_TFTCFG_THRESHOLD_1_4: transmit FIFO reaches 1/4 of its depth
      \arg        USART_TFTCFG_THRESHOLD_1_2: transmit FIFO reaches 1/2 of its depth
      \arg        USART_TFTCFG_THRESHOLD_3_4: transmit FIFO reaches 3/4 of its depth
      \arg        USART_TFTCFG_THRESHOLD_7_8: transmit FIFO reaches 7/8 of its depth
      \arg        USART_TFTCFG_THRESHOLD_EMPTY: transmit FIFO becomes empty
    \param[out] none
    \retval     none
*/
void usart_transmit_fifo_threshold_config(uint32_t usart_periph, uint32_t txthreshold)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0047U), ERR_PERIPH);
    } else if(NOT_USART_TFTCFG_THRESHOLD_CONFIG(txthreshold)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0047U), ERR_PARAM_INVALID);
    } else
#endif
    {
        USART_FCS(usart_periph) &= ~(USART_FCS_TFTCFG);
        USART_FCS(usart_periph) |= txthreshold;
    }
}

/*!
    \brief      configure receive FIFO threshold
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  usart_periph: receive FIFO threshold
                only one parameter can be selected which is shown as below:
      \arg        USART_RFTCFG_THRESHOLD_1_8: receive FIFO reaches 1/8 of its depth
      \arg        USART_RFTCFG_THRESHOLD_1_4: receive FIFO reaches 1/4 of its depth
      \arg        USART_RFTCFG_THRESHOLD_1_2: receive FIFO reaches 1/2 of its depth
      \arg        USART_RFTCFG_THRESHOLD_3_4: receive FIFO reaches 3/4 of its depth
      \arg        USART_RFTCFG_THRESHOLD_7_8: receive FIFO reaches 7/8 of its depth
      \arg        USART_RFTCFG_THRESHOLD_FULL: receive FIFO becomes full
    \param[out] none
    \retval     none
*/
void usart_receive_fifo_threshold_config(uint32_t usart_periph, uint32_t rxthreshold)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0048U), ERR_PERIPH);
    } else if(NOT_USART_RFTCFG_THRESHOLD_CONFIG(rxthreshold)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0048U), ERR_PARAM_INVALID);
    } else
#endif
    {
        USART_FCS(usart_periph) &= ~(USART_FCS_RFTCFG);
        USART_FCS(usart_periph) |= rxthreshold;
    }
}

/*!
    \brief      read receive FIFO counter number
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[out] none
    \retval     uint8_t: receive FIFO counter number
*/
uint8_t usart_receive_fifo_counter_number(uint32_t usart_periph)
{
    uint32_t cnt = 0U;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x0049U), ERR_PERIPH);
    } else
#endif
    {
        cnt |= GET_BITS(USART_FCS(usart_periph), 12U, 14U);
        cnt |= (GET_BITS(USART_FCS(usart_periph), 1U, 2U) << FCS_RFCNT_3_4_OFFSET);
    }
    return (uint8_t)(cnt);
}

/*!
    \brief      get flag in STAT/CHC/FCS register
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise error flag
      \arg        USART_FLAG_ORERR: overrun error
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_RFNE: receive FIFO not empty(when FIFO is enabled)
      \arg        USART_FLAG_RBNE: read data buffer not empty(when FIFO is disabled)
      \arg        USART_FLAG_TC: transmission completed
      \arg        USART_FLAG_TFNF: transmit FIFO not full(when FIFO is enabled)
      \arg        USART_FLAG_TBE: transmit data register empty(when FIFO is disabled)
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_CTS: CTS level
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_BSY: busy flag
      \arg        USART_FLAG_AM0: address 0 match flag
      \arg        USART_FLAG_AM1: address 1 match flag
      \arg        USART_FLAG_SB: send break flag
      \arg        USART_FLAG_RWU: receiver wakeup from mute mode.
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_TEA: transmit enable acknowledge flag
      \arg        USART_FLAG_REA: receive enable acknowledge flag
      \arg        USART_FLAG_EPERR: early parity error flag
      \arg        USART_FLAG_RFE: receive FIFO empty flag
      \arg        USART_FLAG_RFF: receive FIFO full flag
      \arg        USART_FLAG_TFT: transmit FIFO threshold flag
      \arg        USART_FLAG_TFE: transmit FIFO empty flag
      \arg        USART_FLAG_TFF: transmit FIFO full flag
      \arg        USART_FLAG_RFT: receive FIFO threshold flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus usart_flag_get(uint32_t usart_periph, usart_flag_enum flag)
{
    FlagStatus reval = RESET;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x004AU), ERR_PERIPH);
    } else
#endif
    {
        if(RESET != (USART_REG_VAL(usart_periph, flag) & BIT(USART_BIT_POS(flag)))) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear USART status
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  flag: flag type
                only one parameter can be selected which is shown as below:
      \arg        USART_FLAG_PERR: parity error flag
      \arg        USART_FLAG_FERR: frame error flag
      \arg        USART_FLAG_NERR: noise detected flag
      \arg        USART_FLAG_ORERR: overrun error flag
      \arg        USART_FLAG_IDLE: idle line detected flag
      \arg        USART_FLAG_TC: transmission complete flag
      \arg        USART_FLAG_LBD: LIN break detected flag
      \arg        USART_FLAG_CTSF: CTS change flag
      \arg        USART_FLAG_RT: receiver timeout flag
      \arg        USART_FLAG_EB: end of block flag
      \arg        USART_FLAG_AM0: address 0 match flag
      \arg        USART_FLAG_AM1: address 1 match flag
      \arg        USART_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_FLAG_EPERR: early parity error flag
      \arg        USART_FLAG_TFE: transmit FIFO empty flag
    \param[out] none
    \retval     none
*/
void usart_flag_clear(uint32_t usart_periph, usart_flag_enum flag)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x004BU), ERR_PERIPH);
    } else
#endif
    {
        if(USART_FLAG_AM1 == flag) {
            USART_INTC(usart_periph) |= USART_INTC_AMC1;
        } else if(USART_FLAG_EPERR == flag) {
            USART_CHC(usart_periph) &= (uint32_t)(~USART_CHC_EPERR);
        } else if(USART_FLAG_TFE == flag) {
            USART_FCS(usart_periph) |= USART_FCS_TFEC;
        } else {
            USART_INTC(usart_periph) |= BIT(USART_BIT_POS(flag));
        }
    }
}

/*!
    \brief      enable USART interrupt
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  interrupt: interrupt type
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle interrupt
      \arg        USART_INT_RFNE: receive FIFO not empty interrupt and overrun error interrupt(when FIFO is enabled)
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt enable interrupt(when FIFO is disabled)
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TFNF: transmit FIFO not full interrupt(when FIFO is enabled)
      \arg        USART_INT_TBE: transmit data register empty interrupt(when FIFO is disabled)
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM0: address 0 match interrupt
      \arg        USART_INT_AM1: address 1 match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt enable in multibuffer communication
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_TFE: transmit FIFO empty interrupt
      \arg        USART_INT_TFT: transmit FIFO threshold interrupt
      \arg        USART_INT_RFT: receive FIFO threshold interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void usart_interrupt_enable(uint32_t usart_periph, usart_interrupt_enum interrupt)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x004CU), ERR_PERIPH);
    } else
#endif
    {
        USART_REG_VAL(usart_periph, interrupt) |= BIT(USART_BIT_POS(interrupt));
    }
}

/*!
    \brief      disable USART interrupt
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  interrupt: interrupt type
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_IDLE: idle interrupt
      \arg        USART_INT_RFNE: receive FIFO not empty interrupt and overrun error interrupt(when FIFO is enabled)
      \arg        USART_INT_RBNE: read data buffer not empty interrupt and overrun error interrupt enable interrupt(when FIFO is disabled)
      \arg        USART_INT_TC: transmission complete interrupt
      \arg        USART_INT_TFNF: transmit FIFO not full interrupt(when FIFO is enabled)
      \arg        USART_INT_TBE: transmit data register empty interrupt(when FIFO is disabled)
      \arg        USART_INT_PERR: parity error interrupt
      \arg        USART_INT_AM0: address 0 match interrupt
      \arg        USART_INT_AM1: address 1 match interrupt
      \arg        USART_INT_RT: receiver timeout interrupt
      \arg        USART_INT_EB: end of block interrupt
      \arg        USART_INT_LBD: LIN break detection interrupt
      \arg        USART_INT_ERR: error interrupt enable in multibuffer communication
      \arg        USART_INT_CTS: CTS interrupt
      \arg        USART_INT_WU: wakeup from deep-sleep mode interrupt
      \arg        USART_INT_TFE: transmit FIFO empty interrupt
      \arg        USART_INT_TFT: transmit FIFO threshold interrupt
      \arg        USART_INT_RFT: receive FIFO threshold interrupt
      \arg        USART_INT_RFF: receive FIFO full interrupt
    \param[out] none
    \retval     none
*/
void usart_interrupt_disable(uint32_t usart_periph, usart_interrupt_enum interrupt)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x004DU), ERR_PERIPH);
    } else
#endif
    {
        USART_REG_VAL(usart_periph, interrupt) &= ~BIT(USART_BIT_POS(interrupt));
    }
}

/*!
    \brief      get USART interrupt and flag status
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  int_flag: interrupt and flag type, refer to usart_interrupt_flag_enum
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_EB: end of block interrupt and flag
      \arg        USART_INT_FLAG_RT: receiver timeout interrupt and flag
      \arg        USART_INT_FLAG_AM0: address 0 match interrupt and flag
      \arg        USART_INT_FLAG_AM1: address 1 match interrupt and flag
      \arg        USART_INT_FLAG_PERR: parity error interrupt and flag
      \arg        USART_INT_FLAG_TBE: transmitter buffer empty interrupt and flag(when FIFO is disabled)
      \arg        USART_INT_FLAG_TFNF: transmit FIFO not full interrupt and flag(when FIFO is enabled)
      \arg        USART_INT_FLAG_TC: transmission complete interrupt and flag
      \arg        USART_INT_FLAG_RBNE: read data buffer not empty interrupt and flag(when FIFO is disabled)
      \arg        USART_INT_FLAG_RFNE: receive FIFO not empty interrupt and flag(when FIFO is enabled)
      \arg        USART_INT_FLAG_RBNE_ORERR: read data buffer not empty interrupt and overrun error flag(when FIFO is disabled)
      \arg        USART_INT_FLAG_RFNE_ORERR: receive FIFO not empty interrupt and overrun error flag(when FIFO is enabled)
      \arg        USART_INT_FLAG_IDLE: IDLE line detected interrupt and flag
      \arg        USART_INT_FLAG_LBD: LIN break detected interrupt and flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode interrupt and flag
      \arg        USART_INT_FLAG_CTS: CTS interrupt and flag
      \arg        USART_INT_FLAG_ERR_NERR: error interrupt and noise error flag
      \arg        USART_INT_FLAG_ERR_ORERR: error interrupt and overrun error
      \arg        USART_INT_FLAG_ERR_FERR: error interrupt and frame error flag
      \arg        USART_INT_FLAG_TFT: transmit FIFO threshold interrupt and flag
      \arg        USART_INT_FLAG_TFE: transmit FIFO empty interrupt and flag
      \arg        USART_INT_FLAG_RFT: receive FIFO threshold interrupt and flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt and flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus usart_interrupt_flag_get(uint32_t usart_periph, usart_interrupt_flag_enum int_flag)
{
    FlagStatus reval = RESET;
    uint32_t intenable = 0U, flagstatus = 0U;
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x004EU), ERR_PERIPH);
    } else
#endif
    {
        /* get the interrupt enable bit status */
        intenable = (USART_REG_VAL(usart_periph, int_flag) & BIT(USART_BIT_POS(int_flag)));
        /* get the corresponding flag bit status */
        flagstatus = (USART_REG_VAL2(usart_periph, int_flag) & BIT(USART_BIT_POS2(int_flag)));

        if(flagstatus && intenable) {
            reval = SET;
        } else {
            reval = RESET;
        }
    }
    return reval;
}

/*!
    \brief      clear USART interrupt flag
    \param[in]  usart_periph: USARTx(x=0,1,2,5), UARTx(x=3,4,6,7)
    \param[in]  flag: USART interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        USART_INT_FLAG_PERR: parity error flag
      \arg        USART_INT_FLAG_ERR_FERR: frame error flag
      \arg        USART_INT_FLAG_ERR_NERR: noise detected flag
      \arg        USART_INT_FLAG_RBNE_ORERR: read data buffer not empty interrupt and overrun error flag
      \arg        USART_INT_FLAG_ERR_ORERR: error interrupt and overrun error
      \arg        USART_INT_FLAG_IDLE: idle line detected flag
      \arg        USART_INT_FLAG_TC: transmission complete flag
      \arg        USART_INT_FLAG_LBD: LIN break detected flag
      \arg        USART_INT_FLAG_CTS: CTS change flag
      \arg        USART_INT_FLAG_RT: receiver timeout flag
      \arg        USART_INT_FLAG_EB: end of block flag
      \arg        USART_INT_FLAG_AM0: address 0 match flag
      \arg        USART_INT_FLAG_AM1: address 1 match flag
      \arg        USART_INT_FLAG_WU: wakeup from deep-sleep mode flag
      \arg        USART_INT_FLAG_RFT: receive FIFO threshold reach interrupt and flag
      \arg        USART_INT_FLAG_RFF: receive FIFO full interrupt and flag
      \arg        USART_INT_FLAG_TFE: transmit FIFO empty interrupt and flag
    \param[out] none
    \retval     none
*/
void usart_interrupt_flag_clear(uint32_t usart_periph, usart_interrupt_flag_enum int_flag)
{
    /* check parameter */
#ifdef FW_DEBUG_ERR_REPORT
    if(NOT_USART_PERIPH(usart_periph)) {
        fw_debug_report_err(USART_MODULE_ID, API_ID(0x004FU), ERR_PERIPH);
    } else
#endif
    {
        if(USART_INT_FLAG_TFE == int_flag) {
            USART_FCS(usart_periph) |= USART_FCS_TFEC;
        } else if(USART_INT_FLAG_RFF == int_flag) {
            USART_FCS(usart_periph) &= (uint32_t)(~USART_FCS_RFFIF);
        } else if(USART_INT_FLAG_RFT == int_flag) {
            USART_FCS(usart_periph) &= (uint32_t)(~USART_FCS_RFTIF);
        } else {
            USART_INTC(usart_periph) |= BIT(USART_BIT_POS2(int_flag));
        }
    }
}
